# HangerRodKit Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..HangerRodKit Property
FabricationPart Class See Also
---
Specifies whether an ancillary kit is being used to override support rods, bolts and clips, if any. A value of 0 indicates no override is being used.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public int HangerRodKit { get; set; }
```

Visual Basic
---
```text
Public Property HangerRodKit As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int HangerRodKit {
	int get ();
	void set (int value);
}
```

# Remarks
For hangers only. Setting an invalid hanger rod kit will result in the property being unchanged.
# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace